# Importing Libraries

In [1]:
# importing libraries
import pandas as pd
import numpy as  np
import os

In [2]:
df_prods = pd.read_csv(r'C:\Users\makay\Documents\Pythons files\Master folder\02 Data\Original data\products.csv',index_col = False)

In [3]:
dfords = pd.read_csv(r'C:\Users\makay\Documents\Pythons files\Master folder\02 Data\Prepared data\orders_wrangled.csv',index_col = False)

In [4]:
# create a datfrrame
df_test = pd.DataFrame()

In [5]:
# create a mixed type column
df_test['mix'] = ['a', 'b', 1, True]

In [6]:
df_test.head()

    mix
0     a
1     b
2     1
3  True

In [7]:
#check for mixed types 
for col in df_test.columns.tolist():
    weird = (df_test[[col]].applymap(type) != df_test[[col]].iloc[0].apply(type)).any(axis = 1)
    if len (df_test[weird]) > 0:
        print(col)

mix

In [8]:
df_prods.isnull().sum()

product_id        0
product_name     16
aisle_id          0
department_id     0
prices            0
dtype: int64

In [9]:
df_nan = df_prods[df_prods['product_name'].isnull() == True]

In [10]:
df_nan

       product_id product_name  aisle_id  department_id  prices
33             34          NaN       121             14    12.2
68             69          NaN        26              7    11.8
115           116          NaN        93              3    10.8
261           262          NaN       110             13    12.1
525           525          NaN       109             11     1.2
1511         1511          NaN        84             16    14.3
1780         1780          NaN       126             11    12.3
2240         2240          NaN        52              1    14.2
2586         2586          NaN       104             13    12.4
3159         3159          NaN       126             11    13.1
3230         3230          NaN       120             16    14.4
3736         3736          NaN        41              8    14.8
4283         4283          NaN        77              7    14.4
4790         4790          NaN        91             16    14.5
38187       38183          NaN        39             12    20.9
40444       40440          NaN       120             16    14.8

In [11]:
df_prods.shape

(49693, 5)

In [12]:
df_prods_clean = df_prods[df_prods['product_name'].isnull() == False]

In [13]:
df_prods_clean.shape

(49677, 5)

In [14]:
df_dups = df_prods_clean[df_prods_clean.duplicated()]

In [15]:
df_dups

,product_id,product_name,aisle_id,department_id,prices
462,462,Fiber 4g Gummy Dietary Supplement,70,11,4.8
18459,18458,Ranger IPA,27,5,9.2
26810,26808,Black House Coffee Roasty Stout Beer,27,5,13.4
35309,35306,Gluten Free Organic Peanut Butter & Chocolate ...,121,14,6.8
35495,35491,Adore Forever Body Wash,127,11,9.9

In [16]:
df_prods_clean.shape

(49677, 5)

In [17]:
df_prods_clean_no_dups = df_prods_clean.drop_duplicates()

In [18]:
df_prods_clean_no_dups.shape

(49672, 5)

In [19]:
path = r'C:\Users\makay\Documents\Pythons files'

In [20]:
df_prods = pd.read_csv (os.path.join(path,'Master folder', '02 Data', 'Original data', 'products.csv'), index_col = False)

In [21]:
df_prods_clean_no_dups.to_csv(os.path.join(path,'Master folder', '02 Data', 'Prepared data', 'products_clean.csv'))

# Class Assignment

In [22]:
df_ords = pd.read_csv (os.path.join(path,'Master folder', '02 Data', 'Original data', 'orders.csv'), index_col = False)

In [23]:
df_prods.describe()

         product_id      aisle_id  department_id        prices
count  49693.000000  49693.000000   49693.000000  49693.000000
mean   24844.345139     67.770249      11.728433      9.994136
std    14343.717401     38.316774       5.850282    453.519686
min        1.000000      1.000000       1.000000      1.000000
25%    12423.000000     35.000000       7.000000      4.100000
50%    24845.000000     69.000000      13.000000      7.100000
75%    37265.000000    100.000000      17.000000     11.200000
max    49688.000000    134.000000      21.000000  99999.000000

#  Min column is  the same for all and max for prices seems too  high based on the 50% and mean compared to it

In [24]:
for col in df_ords.columns.tolist():
    weird = (df_ords[[col]].applymap(type) != df_ords[[col]].iloc[0].apply(type)).any(axis = 1)
    if len (df_ords[weird]) > 0:
        print(col)

#  No  results for  mixed columns  in df_ords

In [25]:
df_ords.isnull().sum()

order_id                       0
user_id                        0
eval_set                       0
order_number                   0
order_dow                      0
order_hour_of_day              0
days_since_prior_order    206209
dtype: int64

# All columns are fine until you get to days_since_prior_order which has a very large amount of  missing values

In [26]:
# Create new subset containing null values
df_nulls = df_ords[df_ords['days_since_prior_order'].isnull() == True]

In [27]:
df_nulls.head(20)

,order_id,user_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order
0,2539329,1,prior,1,2,8,NaN
11,2168274,2,prior,1,2,11,NaN
26,1374495,3,prior,1,1,14,NaN
39,3343014,4,prior,1,6,11,NaN
45,2717275,5,prior,1,3,12,NaN
50,2086598,6,prior,1,5,18,NaN
54,2565571,7,prior,1,3,9,NaN
75,600894,8,prior,1,6,0,NaN
79,280530,9,prior,1,1,17,NaN
83,1224907,10,prior,1,2,14,NaN
89,2411567,11,prior,1,0,11,NaN
97,1483446,12,prior,1,1,12,NaN
103,2618231,13,prior,1,6,12,NaN
116,2906263,14,prior,1,2,18,NaN
130,2514324,15,prior,1,5,13,NaN
153,1273676,16,prior,1,2,8,NaN
160,1737705,17,prior,1,2,13,NaN
201,2780889,18,prior,1,6,18,NaN
208,1321974,19,prior,1,6,13,NaN
218,947722,20,prior,1,1,10,NaN

#  Creating column for first_time_ordering with true or false value

In [29]:
df_ords.shape

(3421083, 7)

In [30]:
df_nulls.shape

(206209, 7)

In [31]:
#Adding a true/false column for First Time Orders
df_ords['first_time_ordering'] = np.where(df_ords['days_since_prior_order'].isnull(), True, False)

In [32]:
df_ords.head()

,order_id,user_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order,first_time_ordering
0,2539329,1,prior,1,2,8,NaN,True
1,2398795,1,prior,2,3,7,15.0,False
2,473747,1,prior,3,3,12,21.0,False
3,2254736,1,prior,4,4,7,29.0,False
4,431534,1,prior,5,4,15,28.0,False

In [34]:
# finding duplicates in data
df_dups = df_ords[df_ords.duplicated()]

In [35]:
df_dups

Empty DataFrame
Columns: [order_id, user_id, eval_set, order_number, order_dow, order_hour_of_day, days_since_prior_order, first_time_ordering]
Index: []

# Per results no duplicates are shown

In [36]:
df_prods.to_csv(os.path.join(path,'Master folder', '02 Data', 'Prepared data', 'products_no_dups.csv'))

In [37]:
df_ords.to_csv(os.path.join(path,'Master folder', '02 Data', 'Prepared data', 'ords_no_dups.csv'))